posts/poluchit-sms-s-telefona/index.html
<!DOCTYPE html>
<html prefix="
        og: http://ogp.me/ns# article: http://ogp.me/ns/article#
    " vocab="http://ogp.me/ns" lang="ru">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Получить смс с android телефона | VelikiiNehochuha Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="ru" href="../../rss.xml">
<link rel="canonical" href="http://velikiinehochuha.github.io/posts/poluchit-sms-s-telefona/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Velikii Nehochuha">
<link rel="next" href="../binarnyi-poisk-realizatsiia-na-python/" title="Бинарный поиск (реализация на python)" type="text/html">
<meta property="og:site_name" content="VelikiiNehochuha Blog">
<meta property="og:title" content="Получить смс с android телефона">
<meta property="og:url" content="http://velikiinehochuha.github.io/posts/poluchit-sms-s-telefona/">
<meta property="og:description" content="Если есть root доступ по adb


Подключаемся по adb и запускаем запускаем отладочный сервер


adb root
adb start-server
adb tcpip 5555
adb connect host:5555 # adb over wi-fi



Все SMS хранятся в базе ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-11-02T23:40:11+03:00">
<meta property="article:tag" content="android">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Перейти к главному содержимому</a>
    <div id="container">
             <header id="header"><h1 id="brand"><a href="http://velikiinehochuha.github.io/" title="VelikiiNehochuha Blog" rel="home">

        <span id="blog-title">VelikiiNehochuha Blog</span>
    </a></h1>

        
            <nav id="menu"><ul>
<li><a href="../../archive.html">Архив</a></li>
                <li><a href="../../categories/">Тэги</a></li>
                <li><a href="../../rss.xml">RSS лента</a></li>

    
    
    
    </ul></nav></header><main id="content"><article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Получить смс с android телефона</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Velikii Nehochuha
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2019-11-02T23:40:11+03:00" itemprop="datePublished" title="2019-11-02 23:40">2019-11-02 23:40</time></a>
            </p>
                    <p class="sourceline"><a href="index.org" class="sourcelink">Источник</a></p>

        </div>
        
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org38b0488" class="outline-2">
<h2 id="org38b0488">Если есть root доступ по adb</h2>
<div class="outline-text-2" id="text-org38b0488">
<p>
Подключаемся по adb и запускаем запускаем отладочный сервер
</p>

<div class="highlight"><pre><span></span>adb root
adb start-server
adb tcpip 5555
adb connect host:5555 # adb over wi-fi
</pre></div>

<p>
Все SMS хранятся в базе данных mmssms.db, ищем её на устройстве
</p>
<div class="highlight"><pre><span></span>find / -name "*mmssms*" # in my case it is /data/user_de/0/com.android.providers.telephony/databases/mmssms.db
</pre></div>

<p>
Считываем из базы данных
</p>
<div class="highlight"><pre><span></span>sqlite3 /data/user_de/0/com.android.providers.telephony/databases/mmssms.db
select * from sms limit 3;
</pre></div>

<p>
Я часто раздаю интернет через hotsport с телефона, поэтому однострочником будет
</p>
<div class="highlight"><pre><span></span>ip -4 route list 0/0 | awk '{print $3}' | (read _default_route; adb connect $_default_route:5555) &amp;&amp; adb root &amp;&amp; adb shell 'sqlite3 /data/user_de/0/com.android.providers.telephony/databases/mmssms.db -batch "select * from sms limit 2";'
</pre></div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/android/" rel="tag">android</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="next">
                <a href="../binarnyi-poisk-realizatsiia-na-python/" rel="next" title="Бинарный поиск (реализация на python)">Следующая запись</a>
            </li>
        </ul></nav></aside></article></main><footer id="footer"><p>Contents © 2020         <a href="mailto:anton.s.pilipenko@gmail.com">Velikii Nehochuha</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
                <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
